# Кейс-задача № 3: Генератор случайных чисел

## Описание задачи

Написать программу на языке Python, которая:
- Генерирует последовательность случайных чисел (накапливает их в списке)
- Продолжает генерацию до тех пор, пока пользователь не введёт ноль
- Выводит на экран всю накопленную последовательность чисел, кроме последнего (нуля)

## Структура проекта

```
ex03/
├── main.py              # Основная программа
├── example_usage.py     # Примеры использования
├── test_cases.py        # Тестовые случаи
└── README.md           # Документация
```

## Функциональность

### Основная программа (`main.py`)

Программа реализует следующий алгоритм:

1. **Инициализация**: Создаётся пустой список для хранения последовательности чисел
2. **Генерация**: В цикле генерируются случайные числа от 1 до 100 и добавляются в последовательность
3. **Ввод пользователя**: После каждого сгенерированного числа запрашивается ввод
4. **Проверка условия**: Если пользователь вводит 0, цикл прерывается
5. **Обработка ошибок**: Корректно обрабатываются некорректные вводы
6. **Вывод результата**: Отображается вся накопленная последовательность чисел (кроме последнего)

### Ключевые особенности

- **Диапазон чисел**: 1-100
- **Обработка ошибок**: Программа не падает при некорректном вводе
- **Информативный вывод**: Показывает процесс генерации и финальный результат
- **Подсчёт чисел**: Отображает общее количество сгенерированных чисел

## Использование

### Запуск основной программы

```bash
cd ex03
python main.py
```

### Пример работы

```
Программа генерирует случайные числа.
Введите 0, чтобы остановить генерацию.
----------------------------------------
Сгенерировано число: 42
Введите число (0 для остановки): 5
Вы ввели: 5
Сгенерировано число: 17
Введите число (0 для остановки): 0

========================================
РЕЗУЛЬТАТ:
Все сгенерированные числа (кроме последнего):
1. 42
2. 17

Всего сгенерировано чисел: 2
```

### Запуск примеров

```bash
python example_usage.py
```

### Запуск тестов

```bash
python test_cases.py
```

## Тестирование

Программа включает комплексные тесты, проверяющие:

- **Немедленная остановка**: Корректная работа при вводе 0 сразу
- **Множественные числа**: Обработка длинных последовательностей
- **Некорректный ввод**: Обработка ошибок ввода
- **Диапазон чисел**: Проверка корректности генерируемых чисел
- **Логика программы**: Тестирование основных алгоритмов

## Технические детали

### Используемые модули

- `random`: Для генерации случайных чисел
- `unittest`: Для тестирования (в test_cases.py)
- `unittest.mock`: Для симуляции пользовательского ввода в тестах

### Алгоритм работы

```python
while True:
    # 1. Генерируем случайное число
    random_number = random.randint(1, 100)
    numbers.append(random_number)
    
    # 2. Запрашиваем ввод пользователя
    user_input = input("Введите число (0 для остановки): ")
    
    # 3. Проверяем условие остановки
    if int(user_input) == 0:
        break
    
    # 4. Обрабатываем ошибки ввода
    except ValueError:
        continue

# 5. Выводим результат
for i, num in enumerate(numbers, 1):
    print(f"{i}. {num}")
```

## Граничные случаи

Программа корректно обрабатывает:

- **Пустой ввод**: Повторный запрос ввода
- **Некорректные символы**: Сообщение об ошибке и повторный запрос
- **Отрицательные числа**: Обрабатываются как обычные числа
- **Большие числа**: Обрабатываются корректно

## Возможные улучшения

1. **Настройка диапазона**: Позволить пользователю задавать диапазон чисел
2. **Статистика**: Добавить статистику (среднее, минимум, максимум)
3. **Сохранение**: Сохранение результатов в файл
4. **Графический интерфейс**: Создание GUI версии
5. **Логирование**: Добавление системы логирования

## Автор

Программа создана в рамках выполнения кейс-задачи № 3 по программированию на Python. 